/*
 * ------------------------------------------------------------------------
 *  Name:   F2DSprite.h
 *  Desc:   本文件定义了引擎的二维精灵对象。
 *  Author: Yish
 *  Date:   2012/3/17
 *  ----------------------------------------------------------------------
 *  CopyRight (C) YishSoft. All right Observed.
 * ------------------------------------------------------------------------
 */


#ifndef __F2D_SPRITE_H__
#define __F2D_SPRITE_H__


//// HEADERS OF THIS FILE /////////////////////////////////////////////////
#include "F3DTypes.h"

///////////////////////////////////////////////////////////////////////////


/** 二维精灵
*/
class FAIRY_API F2DSprite : public FGeneralAlloc
{
public:
    F2DSprite();
    virtual ~F2DSprite() {};
};

///////////////////////////////////////////////////////////////////////////

#endif  //#ifndef __F2D_SPRITE_H__