/*
 * ------------------------------------------------------------------------
 *  Name:   F3DRain.h
 *  Desc:   本文件定义了引擎的雨天气效果。
 *  Author: Yish
 *  Date:   2012/2/8
 *  ----------------------------------------------------------------------
 *  CopyRight (C) YishSoft. All right Observed.
 * ------------------------------------------------------------------------
 */


#ifndef __F3D_RAIN_H__
#define __F3D_RAIN_H__


//// HEADERS OF THIS FILE /////////////////////////////////////////////////
#include "F3DTypes.h"

///////////////////////////////////////////////////////////////////////////


/** 雨效果
*/
class FAIRY_API F3DRain //: public F3DParticleSystem
{
public:
	F3DRain();
	virtual ~F3DRain() {};
};

///////////////////////////////////////////////////////////////////////////

#endif	//#ifndef __F3D_RAIN_H__