/*
 * ------------------------------------------------------------------------
 *  Name:   F3DSunMoon.h
 *  Desc:   本文件定义了引擎的日月系统。
 *  Author: Yish
 *  Date:   2012/12/22
 *  ----------------------------------------------------------------------
 *  CopyRight (C) YishSoft. All right Observed.
 * ------------------------------------------------------------------------
 */


#ifndef __F3D_SUNMOON_H__
#define __F3D_SUNMOON_H__


//// HEADERS OF THIS FILE /////////////////////////////////////////////////
#include "F3DTypes.h"

///////////////////////////////////////////////////////////////////////////


/** 日月系统
*/
class FAIRY_API F3DSunMoon : public FGeneralAlloc
{
public:
	F3DSunMoon();
	virtual ~F3DSunMoon() {}

};

///////////////////////////////////////////////////////////////////////////

#endif	//#ifndef __F3D_SUNMOON_H__