/*
* -------------------------------------------------------------------------
*  Name:   F3DSnow.h
*  Desc:   本文件定义了引擎的雪天气效果。
*  Author: Yish
*  Date:   2012/2/8
*  -----------------------------------------------------------------------
*  CopyRight (C) YishSoft. All right Observed.
* -------------------------------------------------------------------------
*/


#ifndef __F3D_RAIN_H__
#define __F3D_RAIN_H__


//// HEADERS OF THIS FILE /////////////////////////////////////////////////
#include "F3DTypes.h"

///////////////////////////////////////////////////////////////////////////


/** 雪效果
*/
class FAIRY_API F3DSnow //: public F3DParticleSystem
{
public:
	F3DSnow();
	virtual ~F3DSnow() {};
};

///////////////////////////////////////////////////////////////////////////

#endif	//#ifndef __F3D_SNOW_H__