/*
 * ------------------------------------------------------------------------
 *  Name:   F3DSkinMesh.h
 *  Desc:   本文件定义了一个引擎的蒙皮网格类。
 *  Author: Yish
 *  Date:   2013/1/9
 *  ----------------------------------------------------------------------
 *  CopyRight (C) YishSoft. All right Observed.
 * ------------------------------------------------------------------------
 */


#ifndef __F3D_SKINMESH_H__
#define __F3D_SKINMESH_H__


//// HEADERS OF THIS FILE /////////////////////////////////////////////////
#include "F3DTypes.h"

///////////////////////////////////////////////////////////////////////////


/** 蒙皮网格
@remarks
	该对象时蒙皮骨骼模型的一部分，角色可以分上衣，下衣，手臂，鞋子，头部等等
	各个部位。
*/
class FAIRY_API F3DSkinMesh
{
public:
	F3DSkinMesh();
	virtual ~F3DSkinMesh() {}

protected:

};

///////////////////////////////////////////////////////////////////////////

#endif	//#ifndef __F3D_SKINMESH_H__